Revit 2027 API
SunAndShadowSettings.IsGroundPlaneLevelValid Method
 Checks whether the element represents a valid Ground Plane level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsGroundPlaneLevelValid(
	ElementId levelId
)
Public Function IsGroundPlaneLevelValid (
	levelId As ElementId
) As Boolean
public:
bool IsGroundPlaneLevelValid(
	ElementId^ levelId
)
member IsGroundPlaneLevelValid :
        levelId : ElementId -> bool
Parameters
levelId ElementId
 Level element id.
Return Value
Boolean
 True if the element is a valid Ground Plane Level, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace